
/*
 1. сетка. массив лет/месяцев/недель/дней/часов... (размерность сетки) от начальной до конечной точки
 -выкидываем из массива часть точек (опр. периоды размерности сетки (пн-пт) и тп.)
 -если нужно выкидываем из остатка точки по ФУНКЦИИ ЧАСТОТЫ. Тогда нужна еще
 СУПЕРРАЗМЕРНОСТЬ. Напр размерность день суперразмерность неделя. Функция частоты от 0 до 1. 
 Считаем ее значение в начале каждого интервала суперразмерности
 кол во точек которые надо оставить в интервале равно этой частоте умножить на кол во точек в интервале
 эти точки раскидываем по интервалу равномерно начиная с заполненной точки и через равные промежутки
 -в результате остается массив действующих точек. По нему считаем выдавать сообщение или нет. 
 По нему же считаем ОБЪЕМ СЕТКИ = ОБЪЕМ ВРЕМЕНИ

 2. Величина нагрузки. Размерность величины. Считанм по ФОРМУЛЕ-ПОСЛЕДОВАТЕЛЬНОСТИ НАГРУЗКИ 
 */



//============================================================ 
//============================================================ 
//============================================================ 
//============================================================ 
var TABLE_aCalendar=[
	//===  значения колонок  ====
	["id"
		,"parentid"
		,"globalsid"
		,"level"
		,"formula"
		,"popravka"
		,"dimension"
		,"name"
		,"period_description"
		,"period_formula"
		,"button_onclick"
		,"style"
	],
	//доступ по имени поля а не по индексу такой:  item[ Gl_aDeals[0].indexOf('name') ]
	//!!! нужно делать доступ по имени поля чтобы всегда можно было добавить поля
	["id"
		,"дело-родитель"
		,"поле для правильной сортировки в дереве(не заполнять,рассчитается в процессе)"
		,"уровень в дереве (не заполнять)"
		,"формула нагрузки дела"
		,"поправка к формуле. например формула - линейный ритм, а поправка - синусоидальный множитель или добавок "
		,"размерность нагрузки"
		,"наименование дела"
		,"описание периодичности"
		,"'функция выводить либо не выводить в тек. список'==''"
		,"функция вызова онлайн ритма, если нужно вывести в виде кнопки"
		,"можно задать особый стиль, подставится в атрибут тэга элемента"
	],
	//зашифрована либо не зашифрована
	["0","","","","","","scripted","scripted","scripted","","",""],
	//===========================

	[1,0,0,0,"","","","ФИЗИЧЕСКАЯ ТРЕНИРОВКА:","","1==1","","font-size:150%"],
	  [70,1,0,0,"","","","5 и 5 минут дриблинг с бросками. легкий бег либо ролики либо степ","утро раб. дня на удаленке","(( [1,2,4,5].indexOf(glOcalendar.currDate.getDay())>=0))&&(glOcalendar.currDate.getHours()<11 )","",""],
	  [80,1,0,0,"","","","5 и 5 минут дриблинг с бросками. степ с резиной","вечер раб. дня на удаленке","(( [1,2,4,5].indexOf(glOcalendar.currDate.getDay())>=0))&&(glOcalendar.currDate.getHours()>11 )","",""],
	  [90,1,0,0,"Math.round(glOcalendar.rithmLinear(glOcalendar.toNum(glOcalendar.currDate,'date'),{x:20200101,y:12},{x:20211212,y:20}))"
		,"+Math.round((glOcalendar.rithmSin(glOcalendar.toNum(glOcalendar.currDate,'date'),20200101,20200128,2,0,4)))"
		,"раз(вдох и столько же выдох)","дых. в обед равномерно увелич по шагам","","true","",""],
	  [5,1,0,0,"","","","профилактика плоскостоп - 1)подъем на полступни, 2)сведение разведение стоп с трением","","1==1","",""],
	  [6,1,0,0,"","","","ШЕЯ, ПОЗВОНОЧНИК","","1==1","",""],
	  //workout
	  [2,1,0,0,"","","","WORKOUT (доступное движение):","","1==1","","font-size:150%"],
	    [10,2,0,0,"","","","отжимания вниз головой","по понедельникам","glOcalendar.currDate.getDay()==1","",""],
	    [20,2,0,0,"","","","подтягивания на одной руке", "по вторникам","glOcalendar.currDate.getDay()==2","",""],
	    [30,2,0,0,"","","","флаг_", "по четвергам","glOcalendar.currDate.getDay()==4","",""],
	    [40,2,0,0,"","","","флаг", "по пятницам","glOcalendar.currDate.getDay()==5","",""],
	    [50,2,0,0,"","","","спичаги с брусьев на количество", "по субботам","glOcalendar.currDate.getDay()==6","",""],
	    [60,2,0,0,"","","","спичаги с рук на количество. ходьба на руках.", "по воскресеньям","(glOcalendar.currDate.getDay()==0)","","font-size:100%"],

	//health and imp
	[101,0,0,0,"switch (4){case 4: '17';case 6: '18';default: '19';}",""," часов дня","не есть до", "по средам","glOcalendar.currDate.getDay()==3","alert('100500')",""],

	//imp
	[100001,0,0,0,"","","","ЦАРЬ: 6 мин из 60 стоп (7 мин из 99 по раб. дням)", "по выходным","true","","font-size:190%"],

	//imp
	[100002,0,0,0,"","","","придумать ритм переноса еды с вечера на пораньше !время сна<<", "","glOcalendar.rithmFrequency(glOcalendar.toNum(glOcalendar.currDate,'date'),{numerator:1,denominator:5})","","font-size:150%"],
    [100003,0,0,0,"","","","придумать ритм без сахара - !запреты продуктов", "","glOcalendar.rithmFrequency(glOcalendar.toNum(glOcalendar.currDate,'date'),{numerator:1,denominator:7})","","font-size:150%"],
    [100004,0,0,0,"","","","придумать ритм физмат", "","glOcalendar.rithmFrequency(glOcalendar.toNum(glOcalendar.currDate,'date'),{numerator:1,denominator:8})","","font-size:150%"],
    [100005,0,0,0,"","","","придумать эволюцию Трз-ритма. Чтобы с удов. ! -царь-ритм пусть гасит другие ритмы. вместо них он. гасить К(т) процентов ритмов. 10-15 лет. В ритме признак что нельзя гасить", "","glOcalendar.rithmFrequency(glOcalendar.toNum(glOcalendar.currDate,'date'),{numerator:1,denominator:9})","","font-size:150%"],
    [100006,0,0,0,"","","","сух.я завтрак", "среда, пятница, все чаще, ритм на 2 года","((glOcalendar.currDate.getDay()==3)||(glOcalendar.currDate.getDay()==5))&&(glOcalendar.antiSpline(glOcalendar.dateDiff((new Date(2020,04,30)),glOcalendar.currDate,'date'), (function(v) {return (v/(2*365));}) )==1)","","font-size:150%"],
    [100007,0,0,0,"","","","сух.я обед", "среда, пятница, все чаще, ритм на 4 года","((glOcalendar.currDate.getDay()==3)||(glOcalendar.currDate.getDay()==5))&&(glOcalendar.antiSpline(glOcalendar.dateDiff((new Date(2020,04,30)),glOcalendar.currDate,'date'), (function(v) {return (v/(4*365));}) )==1)","","font-size:150%"],
    [100008,0,0,0,"","","","сух.я ужин", "среда, пятница, все чаще, ритм на 8 лет","((glOcalendar.currDate.getDay()==3)||(glOcalendar.currDate.getDay()==5))&&(glOcalendar.antiSpline(glOcalendar.dateDiff((new Date(2020,04,30)),glOcalendar.currDate,'date'), (function(v) {return (v/(8*365));}) )==1)","","font-size:150%"],

	//тест 
	/*
	 [1000200,2,0,0,"","","222 ТЕСТ + switch (4){case 4: '17';case 6: '18';default: '19';}", "всегда","","true","alert('100500')"],
	 [1000300,8,0,0,"","","888 ТЕСТ + switch (4){case 4: '17';case 6: '18';default: '19';}", "всегда","","true","alert('100500')"],
	 [1000400,2,0,0,"","","222 ТЕСТ + switch (4){case 4: '17';case 6: '18';default: '19';}", "всегда","","true","alert('100500')"],
	 [1000500,1000200,0,0,"","","потомок 222 ТЕСТ + switch (4){case 4: '17';case 6: '18';default: '19';}", "всегда","","true","alert('100500')"],
	 */

];
//============================================================ 
//============================================================ 
//============================================================ 
//============================================================ 

